Revit 2017 API
ElectricalSystem Properties
The ElectricalSystem type exposes the following members.
Properties
Name | Description
ApparentCurrent
Returns the ApparentCurrent value of the Electrical System.
ApparentCurrentPhaseA
Returns the ApparentCurrentPhaseA value of the Electrical System.
ApparentCurrentPhaseB
Returns the ApparentCurrentPhaseB value of the Electrical System.
ApparentCurrentPhaseC
Returns the ApparentCurrentPhaseC value of the Electrical System.
ApparentLoad
Returns the ApparentLoad value of the Electrical System.
ApparentLoadPhaseA
Returns the ApparentLoadPhaseA value of the Electrical System.
ApparentLoadPhaseB
Returns the ApparentLoadPhaseB value of the Electrical System.
ApparentLoadPhaseC
Returns the ApparentLoadPhaseC value of the Electrical System.
AssemblyInstanceId
 The id of the assembly instance to which the element belongs.
 (Inherited from Element.)
BalancedLoad
Reports whether the BalancedLoad is on or off.
BaseEquipment
The base panel or equipment of the system.
 (Inherited from MEPSystem.)
BaseEquipmentConnector
The connector within base equipment which is used to connect with system.
 (Inherited from MEPSystem.)
BoundingBox
Retrieves a box that circumscribes all geometry of the element.
 (Inherited from Element.)
Category
Retrieves a Category object that represents the category or sub category in which the element resides.
 (Inherited from Element.)
CircuitNumber
Returns the CircuitNumber of the Electrical System.
CircuitType
Get the circuit type of the Electrical System.
ConnectorManager
Connector manager of the system.
 (Inherited from MEPSystem.)
CreatedPhaseId
 Id of a Phase at which the Element was created.
 (Inherited from Element.)
DemolishedPhaseId
 Id of a Phase at which the Element was demolished.
 (Inherited from Element.)
DesignOption
Returns the design option to which the element belongs.
 (Inherited from Element.)
Document
Returns the Document in which the Element resides.
 (Inherited from Element.)
Elements
Terminal elements in the system.
 (Inherited from MEPSystem.)
Geometry
Retrieves the geometric representation of the element.
 (Inherited from Element.)
GroundConductorsNumber
Returns the GroundConductors Number of the Electrical System.
GroupId
 The id of the group to which an element belongs.
 (Inherited from Element.)
HasDesignParts
 Indicates if the system has one or more design parts.
 (Inherited from MEPSystem.)
HasFabricationParts
 Indicates if the system has one or more fabrication parts.
 (Inherited from MEPSystem.)
HasPlaceholders
 Indicates if the system has one or more placeholders.
 (Inherited from MEPSystem.)
HotConductorsNumber
Returns the HotConductors Number of the Electrical System.
Id
 A unique identifier for an Element in an Autodesk Revit project.
 (Inherited from Element.)
IsEmpty
 Indicates if the system is empty or not.
 (Inherited from MEPSystem.)
IsMultipleNetwork
 Indicates if the system is well connected or not. The flag will enable the "Divide System" button.
 (Inherited from MEPSystem.)
IsTransient
 Indicates whether an element is transient or permanent.
 (Inherited from Element.)
IsValid
 Indicates if the system is valid or not. atom AtomValidateSystem default false
 (Inherited from MEPSystem.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Element.)
Length
Returns the Length value of the Electrical System.
LevelId
 The id of the level associated with the element.
 (Inherited from Element.)
LoadClassifications
Returns the LoadClassifications used in the Electrical System.
LoadName
Get/Set the LoadName of the Electrical System.
Location
This property is used to find the physical location of an element within a project.
 (Inherited from Element.)
Name
Returns the Name of the Electrical System.
 (Overrides Element.Name.)
NeutralConductorsNumber
Returns the NeutralConductors Number of the Electrical System.
OwnerViewId
 The id of the view that owns the element.
 (Inherited from Element.)
PanelName
Returns the Panel name of the Electrical System.
Parameter[Guid]
Retrieves a parameter from the element given a GUID for a shared parameter.
 (Inherited from Element.)
Parameter[BuiltInParameter]
Retrieves a parameter from the element given a parameter id.
 (Inherited from Element.)
Parameter[Definition]
Retrieves a parameter from the element based on its definition.
 (Inherited from Element.)
Parameters
Retrieves a set containing all of the parameters that are contained within the element.
 (Inherited from Element.)
ParametersMap
Retrieves a map containing all of the parameters that are contained within the element.
 (Inherited from Element.)
Pinned
 Identifies if the element has been pinned to prevent changes.
 (Inherited from Element.)
PolesNumber
Returns the Poles Number of the Electrical System.
PowerFactor
Returns the PowerFactor value of the Electrical System.
PowerFactorState
Returns the PowerFactorState type of the Electrical System.
PressureLossOfCriticalPath
 The total pressure loss of the sections in critical path.
 (Inherited from MEPSystem.)
Rating
Get/Set the Rating value of the Electrical System.
RunsNumber
Returns the Runs Number of the Electrical System.
SectionsCount
 The number of sections.
 (Inherited from MEPSystem.)
StartSlot
Get/Set the Start Slot where the Electrical System is located in its panel.
SystemType
Returns the Electrical System Type of the Electrical System.
TrueCurrent
Returns the TrueCurrent value of the Electrical System.
TrueCurrentPhaseA
Returns the TrueCurrentPhaseA value of the Electrical System.
TrueCurrentPhaseB
Returns the TrueCurrentPhaseB value of the Electrical System.
TrueCurrentPhaseC
Returns the TrueCurrentPhaseC value of the Electrical System.
TrueLoad
Returns the TrueLoad value of the Electrical System.
TrueLoadPhaseA
Returns the TrueLoadPhaseA value of the Electrical System.
TrueLoadPhaseB
Returns the TrueLoadPhaseB value of the Electrical System.
TrueLoadPhaseC
Returns the TrueLoadPhaseC value of the Electrical System.
UniqueId
 A stable unique identifier for an element within the document.
 (Inherited from Element.)
ViewSpecific
 Identifies if the element is owned by a view.
 (Inherited from Element.)
Voltage
Returns the Voltage value of the Electrical System.
VoltageDrop
Returns the VoltageDrop value of the Electrical System.
WireSizeString
Returns the WireSize as a String of the Electrical System.
WireType
Get/Set the wire type of the Electrical System.
WorksetId
 Get Id of the Workset which owns the element.
 (Inherited from Element.)
See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace